#- 파이썬에서 기본적으로 제공하는 함수 ----- 내장함수
#크기비교함수
#max()  - 최대값
print(max(3,7,-1,5,4))
#min()  - 최소값
print(min(3,7,-1,5,4))


#연산함수
# sum() - 합계
print(sum([1,2,3,4,5,6,7,8,9,10]))
# pow() - 제곱근
print(pow(2,4))
# divmod() - 몫과 나머지를 구하는 함수
print(divmod(10,3))

#진법 변환 함수
# bin() - 2진수 변환
# act() - 8진수 변환
# hex() - 16진수 변환



# round() - 반올림함수, 
print(round(123.456,1))

# abs() - 절대값 함수
print(abs(-5));
print(abs(5));

print("\\    /\\\n )  ( ') \n(  /  ) \n \\(__)|")
print()
print('|\\_/|\n|q p|   /}\n( 0 )"""\\\n|"^"`    |\n||_/=\\\\__|\n')